Repository: raneri/WP-Purge-CPT
Catalog: languages/raneri-purge-cpt-*.po
Languages: fr_fr, it_it

source: You are not allowed to call this page directly.
fr_fr: Vous n'êtes pas autorisé à ouvrir la page directement.
it_it: Non sei autorizzato a chiamare questa pagina direttamente.

source: Purge CPT
fr_fr: Vide CPT
it_it: Pulisci CPT

source: You do not have sufficient permissions to access this page.
fr_fr: Tu n'as pas assez de privilèges pour accéder à cette page.
it_it: Non hai sufficienti autorizzazioni per accedere a questa pagina.

source: Choose the Custom Post Type you want to be deleted from the database:
fr_fr: Choisis le Custom Post Type que tu veux éliminer de la base de données:
it_it: Scegli il Custom Post Type che desideri eliminare dal database:

source: Select
fr_fr: Sélectionne
it_it: Seleziona

source: Posts, Pages, Revisions, Attachments and Nav_menu_items are not shown here because they are part of the native set of post types.
fr_fr: Les Post, les Pages, les Révisions, les fichiers joints et les menus de navigation ne sont pas visibles ici car ils font partie du set de Post Type par défaut.
it_it: I Post, le Pagine, le Revisioni, gli Allegati e i Nav_menu_items non sono visualizzati qui perché sono parte del set di post type nativi.

source: This is a summary of the current post count in the database, for this Custom Post Type:
fr_fr: Ceci est un résumé du nombre actuel de posts dans la base de données, pour ce Custom Post Type:
it_it: Questo è un riassunto dell'attuale conteggio dei post nel database, per questo Custom Post Type:

source: WARNING: Every post of the chosen custom post type will be ERASED from the database, including the connected metadata. Make sure you have an updated backup copy of the database before proceed. Are you sure to continue?
fr_fr: ATTENTION: Tous les post du Custom Post Type sélectionné seront ÉLIMINÉS de la base de données, inclus aussi toutes leurs données. Assure-toi d'avoir fait une sauvegarde récente avant de continuer. Tu es bien certain de vouloir continuer?
it_it: ATTENZIONE: Tutti i post del custom post type selezionato verranno ELIMINATI dal database, inclusi i relativi metadati. Assicurati di disporre di un backup aggiornato del database prima di procedere. Sei sicuro di continuare?

source: Purge this CPT
fr_fr: Vide ce CPT
it_it: Svuota questo CPT

source: posts have been successful deleted from the database!
fr_fr: les posts ont été éliminés de la base de données avec succès!
it_it: i post sono stati eliminati dal database con successo!

source: Please take note that this function actually cleans the data, but it doesn't cancel the registration of the Custom Post Type. If you want to de-register it, you have to do it yourself.
fr_fr: Tiens compte du fait que cette fonction élimine effectivement les données, mais n'élimine pas l'existence du Custom Post Type. Si tu veux l'éliminer, tu dois le faire toi-même.
it_it: Tieni conto del fatto che questa funzione elimina effettivamente i dati, ma non elimina la registrazione del Custom Post Type. Se vuoi de-registrarlo, devi farlo tu stesso.
